## Adaboosting

In [ ]:
import pandas as pd

SyntaxError: invalid syntax (621131022.py, line 2)

In [ ]:
#from google.colab import drive
#drive.mount('/content/drive')

In [5]:
#df = pd.read_csv('/content/drive/MyDrive/Curso_Logistica/dataset_trat.csv',sep=';')
path = 'C:/Users/alex_/OneDrive/Documentos/04. Carreira/01. Cientista de Dados/Estudos/Estudos/05. Github/_Github_Projetos_/Estudos_XGboost/01. Arquivos/dataset_trat.csv'
df = pd.read_csv(path,sep=';')
df.head()

,ID,SAFRA,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default
0,1,200510,20000,2,2,1,24,2,2,-1,...,0,0,0,0,689,0,0,0,0,1
1,2,200510,120000,2,2,2,26,-1,2,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
2,3,200510,90000,2,2,2,34,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
3,4,200510,50000,2,2,1,37,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
4,5,200510,50000,1,2,1,57,-1,0,-1,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [6]:
df.set_index(['ID','SAFRA'],inplace=True)

In [9]:
df.head()

,,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default
ID,SAFRA,,,,,,,,,,,,,,,,,,,,,
1,200510,20000,2,2,1,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,1
2,200510,120000,2,2,2,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,200510,90000,2,2,2,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,200510,50000,2,2,1,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
5,200510,50000,1,2,1,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [13]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(df.drop(columns=['default']), df['default'] ,test_size=0.3, random_state=123)

In [15]:
#X_train.head()
X_train.shape, X_test.shape, y_train.shape, y_test.shape

((21000, 23), (9000, 23), (21000,), (9000,))

## Ajuste do modelo Adaboost

In [35]:
from sklearn.ensemble import AdaBoostClassifier

In [36]:
abc = AdaBoostClassifier(n_estimators=10)
model = abc.fit(X_train, y_train)
y_pred_train = model.predict(X_train)
y_pred_test = model.predict(X_test)

In [37]:
# Model Accuracy, how often is the classifier correct?
from sklearn import metrics
print("Accuracy:",metrics.accuracy_score(y_train, y_pred_train))
print("Accuracy:",metrics.accuracy_score(y_test, y_pred_test))

Accuracy: 0.8174761904761905
Accuracy: 0.8201111111111111

## Alterar o weak learner

In [44]:
from sklearn.tree import DecisionTreeClassifier

be = DecisionTreeClassifier(max_depth=10)

# Create adaboost classifer object
#abc =AdaBoostClassifier(n_estimators=10, base_estimator=be)
abc =AdaBoostClassifier(n_estimators=10,estimator=be)
# Train Adaboost Classifer
model2 = abc.fit(X_train, y_train)

y_pred_train2 = model2.predict(X_train)
y_pred_test2 = model2.predict(X_test)

In [45]:
# Model Accuracy, how often is the classifier correct?
from sklearn import metrics
print("Accuracy:",metrics.accuracy_score(y_train, y_pred_train2))
print("Accuracy:",metrics.accuracy_score(y_test, y_pred_test2))

Accuracy: 0.8983333333333333
Accuracy: 0.7887777777777778